-- +goose Up

INSERT INTO interests (name, is_verified) VALUES
    ('Футбол', true),
    ('Баскетбол', true),
    ('Хоккей', true),
    ('Теннис', true),
    ('Плавание', true),
    ('Шахматы', true),
    ('Музыка', true),
    ('Рисование', true),
    ('Танцы', true),
    ('Программирование', true),
    ('Робототехника', true),
    ('Minecraft', true),
    ('Видеоигры', true),
    ('Чтение', true),
    ('Кино', true),
    ('Фотография', true),
    ('Путешествия', true),
    ('Кулинария', true),
    ('Космос', true),
    ('Животные', true),
    ('Природа', true),
    ('Наука', true),
    ('История', true),
    ('Математика', true),
    ('Физика', true);

-- +goose Down

DELETE FROM interests WHERE name IN (
    'Футбол', 'Баскетбол', 'Хоккей', 'Теннис', 'Плавание',
    'Шахматы', 'Музыка', 'Рисование', 'Танцы', 'Программирование',
    'Робототехника', 'Minecraft', 'Видеоигры', 'Чтение', 'Кино',
    'Фотография', 'Путешествия', 'Кулинария', 'Космос', 'Животные',
    'Природа', 'Наука', 'История', 'Математика', 'Физика'
);
